src/main/java/ok/dht/test/yasevich/profiling/stage2/wrk/compare/wrk-get-report-new_v2
Running 1m test @ http://localhost:19234
  8 threads and 64 connections
  Thread calibration: mean lat.: 1.467ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.451ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.370ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.457ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.373ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.373ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.363ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.332ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.29ms    0.87ms  60.58ms   85.71%
    Req/Sec     5.93k   449.13    12.44k    72.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.22ms
 75.000%    1.66ms
 90.000%    2.08ms
 99.000%    2.97ms
 99.900%   12.67ms
 99.990%   23.87ms
 99.999%   37.85ms
100.000%   60.61ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.015     0.000000            1         1.00
       0.520     0.100000       225119         1.11
       0.727     0.200000       450289         1.25
       0.899     0.300000       675550         1.43
       1.060     0.400000       900518         1.67
       1.218     0.500000      1124260         2.00
       1.299     0.550000      1237168         2.22
       1.382     0.600000      1349225         2.50
       1.469     0.650000      1461556         2.86
       1.562     0.700000      1574619         3.33
       1.663     0.750000      1687018         4.00
       1.717     0.775000      1742454         4.44
       1.776     0.800000      1799012         5.00
       1.839     0.825000      1854812         5.71
       1.910     0.850000      1911565         6.67
       1.989     0.875000      1967465         8.00
       2.034     0.887500      1995761         8.89
       2.083     0.900000      2024091        10.00
       2.137     0.912500      2052097        11.43
       2.199     0.925000      2080285        13.33
       2.269     0.937500      2107794        16.00
       2.311     0.943750      2122289        17.78
       2.355     0.950000      2135960        20.00
       2.405     0.956250      2150056        22.86
       2.463     0.962500      2164252        26.67
       2.529     0.968750      2177971        32.00
       2.569     0.971875      2185284        35.56
       2.611     0.975000      2192153        40.00
       2.659     0.978125      2199072        45.71
       2.717     0.981250      2206232        53.33
       2.785     0.984375      2213167        64.00
       2.825     0.985938      2216599        71.11
       2.875     0.987500      2220219        80.00
       2.929     0.989062      2223638        91.43
       2.995     0.990625      2227176       106.67
       3.077     0.992188      2230671       128.00
       3.129     0.992969      2232418       142.22
       3.193     0.993750      2234159       160.00
       3.275     0.994531      2235909       182.86
       3.397     0.995313      2237663       213.33
       3.587     0.996094      2239413       256.00
       3.747     0.996484      2240298       284.44
       3.965     0.996875      2241176       320.00
       4.295     0.997266      2242053       365.71
       4.703     0.997656      2242930       426.67
       5.315     0.998047      2243808       512.00
       5.791     0.998242      2244245       568.89
       6.523     0.998437      2244683       640.00
       8.083     0.998633      2245122       731.43
      10.375     0.998828      2245562       853.33
      12.951     0.999023      2246000      1024.00
      14.199     0.999121      2246220      1137.78
      15.447     0.999219      2246439      1280.00
      16.655     0.999316      2246659      1462.86
      17.791     0.999414      2246880      1706.67
      18.879     0.999512      2247101      2048.00
      19.439     0.999561      2247213      2275.56
      20.031     0.999609      2247318      2560.00
      20.687     0.999658      2247427      2925.71
      21.263     0.999707      2247537      3413.33
      21.807     0.999756      2247648      4096.00
      22.063     0.999780      2247703      4551.11
      22.319     0.999805      2247756      5120.00
      22.607     0.999829      2247812      5851.43
      22.959     0.999854      2247866      6826.67
      23.279     0.999878      2247921      8192.00
      23.583     0.999890      2247949      9102.22
      23.903     0.999902      2247977     10240.00
      24.287     0.999915      2248004     11702.86
      24.655     0.999927      2248031     13653.33
      25.119     0.999939      2248059     16384.00
      25.279     0.999945      2248073     18204.44
      25.599     0.999951      2248086     20480.00
      25.855     0.999957      2248100     23405.71
      26.431     0.999963      2248113     27306.67
      27.327     0.999969      2248127     32768.00
      28.255     0.999973      2248134     36408.89
      29.647     0.999976      2248141     40960.00
      30.895     0.999979      2248147     46811.43
      32.351     0.999982      2248154     54613.33
      34.111     0.999985      2248161     65536.00
      35.327     0.999986      2248165     72817.78
      36.543     0.999988      2248168     81920.00
      37.375     0.999989      2248171     93622.86
      38.559     0.999991      2248175    109226.67
      39.647     0.999992      2248178    131072.00
      41.375     0.999993      2248180    145635.56
      44.031     0.999994      2248182    163840.00
      45.375     0.999995      2248183    187245.71
      47.967     0.999995      2248185    218453.33
      50.591     0.999996      2248187    262144.00
      51.775     0.999997      2248188    291271.11
      53.151     0.999997      2248189    327680.00
      53.151     0.999997      2248189    374491.43
      54.495     0.999998      2248190    436906.67
      55.679     0.999998      2248191    524288.00
      56.767     0.999998      2248192    582542.22
      56.767     0.999998      2248192    655360.00
      56.767     0.999999      2248192    748982.86
      57.919     0.999999      2248193    873813.33
      57.919     0.999999      2248193   1048576.00
      59.199     0.999999      2248194   1165084.44
      59.199     0.999999      2248194   1310720.00
      59.199     0.999999      2248194   1497965.71
      59.199     0.999999      2248194   1747626.67
      59.199     1.000000      2248194   2097152.00
      60.607     1.000000      2248195   2330168.89
      60.607     1.000000      2248195          inf
#[Mean    =        1.294, StdDeviation   =        0.875]
#[Max     =       60.576, Total count    =      2248195]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2699180 requests in 1.00m, 196.17MB read
  Non-2xx or 3xx responses: 330968
Requests/sec:  44987.23
Transfer/sec:      3.27MB